{"pages":[{"title":"About","date":"2019-09-11T06:26:15.705Z","path":"about/index.html","text":""},{"title":"Categories","date":"2019-09-11T07:38:14.319Z","path":"categories/index.html","text":""},{"title":"Tags","date":"2019-09-11T07:38:27.042Z","path":"tags/index.html","text":""}],"posts":[{"title":"基础数学知识","date":"2019-09-22T11:11:46.000Z","path":"wiki/计算机基础知识/基础数学知识/","text":"取整操作向上取整：运算称为 Ceiling，用数学符号 ⌈⌉ （上有起止，开口向下）表示。 向下取整：运算称为 Floor，用数学符号 ⌊⌋ （下有起止，开口向上）表示。 注意，向上/向下取整是针对于浮点数而言的，整数向上/向下取整还是整数本身。 可以将待取整的数字置于坐标系的y轴，向上取整则为向上取最近的整数，向下取整则为向下取最近的整数。","tags":[],"categories":[{"name":"计算机基础知识","slug":"计算机基础知识","permalink":"http://blog.tomhurry.com/categories/计算机基础知识/"}]},{"title":"数据结构","date":"2019-09-22T05:29:04.000Z","path":"wiki/计算机基础知识/数据结构/","text":"一些感念 数据结构就是研究数据的逻辑结构和物理结构以及它们之间的相互关系。 数据结构是指数据元素的集合及元素间的相互关系和构造方法。 元素之间的相互关系称为逻辑结构，分为两大类：线性结构和非线性结构 元素与元素之间关系的存储称为存储结构（物理结构） 数据：所有能被输入到计算机中，且能被计算机处理的符号的集合。是计算机操作的对象的总称。 数据元素：数据（集合）中的一个“个体”，数据及结构中讨论的基本单位 数据项：数据的不可分割的最小单位。一个数据元素可由若干个数据项组成。 数据类型：在一种程序设计语言中，变量所具有的数据种类。整型、浮点型、字符型等等 逻辑结构：数据之间的相互关系。 集合 结构中的数据元素除了同属于一种类型外，别无其它关系。 线性结构 数据元素之间一对一的关系 树形结构 数据元素之间一对多的关系 图状结构或网状结构 结构中的数据元素之间存在多对多的关系 物理结构/存储结构：数据在计算机中的表示。物理结构是描述数据具体在内存中的存储（如：顺序结构、链式结构、索引结构、哈希结构）等 在数据结构中,从逻辑上可以将其分为线性结构和非线性结构 数据结构的基本操作的设置的最重要的准则是,实现应用程序与存储结构的独立。实现应用程序是“逻辑结构”，存储的是“物理结构”。逻辑结构主要是对该结构操作的设定，物理结构是描述数据具体在内存中的存储（如：顺序结构、链式结构、索引结构、希哈结构）等。 顺序存储结构中，线性表的逻辑顺序和物理顺序总是一致的。但在链式存储结构中，线性表的逻辑顺序和物理顺序一般是不同的。 算法五个特性： 有穷性、确定性、可行性、输入、输出 算法设计要求：正确性、可读性、健壮性、高效率与低存储量需求。(好的算法) 算法的描述有伪程序、流程图、N-S结构图等。E-R图是实体联系模型，不是程序的描述方式。 设计算法在执行时间时需要考虑：算法选用的规模、问题的规模 时间复杂度：算法的执行时间与原操作执行次数之和成正比。 空间复杂度：若输入数据所占空间只取决于问题本身，和算法无关，则只需要分析除输入和程序之外的辅助变量所占额外空间。 线性表 线性表是最简单、最基本也是最常用的一种线性结构，常采用顺序存储和链式存储，主要的基本操作是插入、删除和查找等。根据存储结构可以分为以下两种： ​ 1.线性表的顺序存储：用一组地址连续的存储单元依次存储数据元素，简称顺序表 ​ 优点：可以随机存取表中的元素，因为存储地址是连续的，所以读取时，只要计算出下标就可以随机访问，存储时按顺序存储。 ​ 缺点：插入和删除操作需要移动元素。 ​ 2.线性表的链式存储：用通过指针链接起来的结点来存储数据元素。结点分为数据域和指针域，数据域用于存储数据元素的值，指针域则存储当前结点的前驱和后继的位置信息。因为地址并不要求是连续的，因此存储数据元素的同时必须存储元素之间的逻辑关系。 ​ 优点：插入和删除操作不需要移动元素 ​ 缺点：不能随机访问 根据指针域的设置方式，可以分为以下几种链表结构： 单链表：若结点中只有一个指针域，则称为线性链表(单链表)，其特点是只能从头结点开始遍历链表。 双向链表：每个结点包含两个指针，分别指向当前结点的直接前驱和直接后继。其特点是可以从表中任意的结点出发，从两个方向上遍历链表。 循环链表：在单向链表(或双向链表)的基础上令尾结点的指针指向头结点，构成循环链表。其特点是可以从表中任意结点开始遍历整个链表。 静态链表： 借助数组来描述线性表的链式存储结构，用数据元素的下标表示元素所在结点的指针。 栈和队列 栈和队列是程序中常用的两种数据结构，逻辑结构和线性表相同。其特点在于运算有所限制：栈按“后进先出”的规则进行操作，队列按“先进先出”的规则进行操作，所以称为运算受限的线性表。 栈栈是只能访问它的一端来实现数据存储和检索的一种线性数据结构，进行插入和删除的一端称为栈顶(Top)，另一端称为栈底(Bottom)，不含数据元素的栈称为空栈。 根据存储结构可以分为顺序栈和链栈，顺序栈空间容量是有限的，所以在插入元素时需要判断是否栈满。链栈不必另外设置头指针，链表的头指针就是栈顶指针。 ​ 顺序存储： ​ 链式存储： 应用：典型应用包括表达式求值、括号匹配、浏览器历史记录等，将递归转变成非递归操作也可以用到栈。 队列队列是一种先进先出(FIFO)的线性表，它只允许在表的一端插入元素，而在表的另一端删除元素。在队列中，允许插入元素的一端称为队尾(Rear)，允许删除元素的一端称为队头(Front)。 ​ 顺序队列：顺序存储结构。当头尾指针相等时队列为空。在非空队列里，头指针始终指向队头前一个位置，而尾指针始终指向队尾元素的实际位置 ​ 循环队列：将顺序队列假想成环状结构(通过整数取余运算实现)。根据定义，空队列和满队列头尾指针指向的位置是相同的，所以为了区分这两个状态可以采用以下两种处理方式： ​ 1.设置一个标志，以区分两个状态 ​ 2.牺牲一个存储单元，约定以“队列的尾指针所指的下一个位置是头指针时”表示队满，相同则表示队空。即队满：(rear+1)%MaxSize==front，队空：rear==front。 ​ 链队列：链式存储结构。限制仅在表头删除和表尾插入的单链表。显然仅有单链表的头指针不便于在表尾做插入操作，为此再增加一个尾指针，指向链表的最后一个结点。 ​ 基本运算： ​ 队空条件：rear==front ​ 队满条件：(rear+1)%MaxSize==front ​ 计算队列长度：(rear-front+MaxSize)%MaxSize ​ 入队：(rear+1)%MaxSize ​ 出队：(front+1)%MaxSize 串 串(String)是一种数据元素为字符的特殊的线性表。 几个基本概念： 空串：长度为零的串称为空串，空串不包含任何字符。 空格串：由一个或多个空格组成的串。 子串：由串中任意长度的连续字符构成的序列称为子串。含有子串的串称为主串。子串在主串中的位置是指子串首次出现时该子串第一个字符在主串的位置。空串是任意串的子串。 串相等：指两个串长度相等且对应序号的字符也相同。 串比较：以ASCII码值(或其他字符编码集合)作为依据。 串匹配：子串的定位操作，子串称为模式串。蛮力法匹配。KMP算法匹配。Boyer-Moore算法匹配。 树 树结构是一种非常重要的非线性结构，该结构中的一个数据元素可以有两个或以上的直接后继元素，树可以用来描述客观世界中广泛存在的层次结构关系。 树的定义是递归的 树的基本概念： 双亲、孩子和兄弟：结点的子树的根称为该结点的孩子；该节点称为其子节点的双亲，具有相同双亲的结点互为兄弟。 结点的度：结点孩子的个数。 叶子结点：指度为0的结点。 内部结点：度不为0的结点，也称为分支结点或非终端结点。 结点的层次：根为第一层，根的孩子为第二层，以此类推，若结点在第i层，则其孩子在第i+1层。 树的高度：一棵树的最大层数记为树的高度(或深度)。 有序(无序)树：若将树中结点的各子树看成是从左到右具有次序的，即不可交换，则为有序树，否则为无序树。 二叉树二叉树是n(n&gt;=0)个结点的有限集合，它或者是空树(n=0)，或者是由一个根节点及两颗不相交的且分别称为左、右子树的二叉树所组成。二叉树具有递归性质。 普通树与二叉树的区别： 二叉树结点的子树有左、右子树的概念，而普通树没有。 二叉树结点最大度为2，而普通树不限制结点的度数。 性质： 二叉树第i层(i&gt;=1)上最多有2i-1个结点。 高度为k的二叉树最多有2k-1个结点(k&gt;=1)。 对于任何一棵二叉树，若其终端结点数为n0,度为2的结点数为n2，则n0=n2+1。 具有n个结点的完全二叉树的深度为⎣log2n⎦+1。 满二叉树： 完全二叉树： 树和森林图无向图 有向图 算法查找 排序 参考资料 数据结构基础概念篇","tags":[],"categories":[{"name":"计算机基础知识","slug":"计算机基础知识","permalink":"http://blog.tomhurry.com/categories/计算机基础知识/"}]},{"title":"hello world","date":"2019-09-16T00:27:58.000Z","path":"wiki/生活学习/hello-world/","text":"Hello，world!my name is taozhi, this is my personal blog.","tags":[],"categories":[{"name":"生活学习","slug":"生活学习","permalink":"http://blog.tomhurry.com/categories/生活学习/"}]},{"title":"git学习笔记","date":"2019-09-11T07:37:24.000Z","path":"wiki/编程杂记/Git/git学习笔记/","text":"1.上传本地项目到github第一步，在github创建新的repository 第二步，在本地建立git仓库 git init 第三步，将项目的所有文件添加到仓库中 git add . 或者 git add * 第四步，提交 git commit -m “更新说明” 第五步，将本地仓库关联到github git remote add origin git@github.com:xxxxxxxx.git 第六步，上传之前pull一下 git pull origin master #根据实际分支而定，如果github上的分支是其他则修改master成一致 第七步，上传push git push -u origin master 2.更新代码第一步，查看当前git仓库状态 git status 第二步，更新全部 git add * 第三步，提交更新 git commit -m “更新说明” 第四步，先pull拉取最新代码 git pull 第五步，上传push git push origin master 3.git分支操作 查看所有分支（包括本地和远程） git branch -a 查看远程分支 git branch -r 切换分支 git checkout &lt;新分支名&gt; #切换到已有分支 git checkout -b &lt;新分支名&gt; #创建新分支并立即切换到该分支下 删除分支 git branch -d &lt;分支名&gt; #删除本地分支 git push origin –delete &lt;分支名&gt; #删除远程分支 合并分支 git merge 4.其他1.git fetch和git pull之间的区别？答：git fetch拉取最新分支但不会自动merge，而git pull则会自动合并","tags":[],"categories":[{"name":"编程杂记","slug":"编程杂记","permalink":"http://blog.tomhurry.com/categories/编程杂记/"},{"name":"Git","slug":"编程杂记/Git","permalink":"http://blog.tomhurry.com/categories/编程杂记/Git/"}]}]}